# Fundamentals of ETL: data extraction, transformation and loading


Course: Course Title

---

# Table of contents

[3.1. Working with **dplyr** package](#chapter31)

---

# 1. General information about ETL

---

# 2. Data Sources for ETL

## 2.1. CSV

## 2.2. Excel (xlsx)

## 2.3. XML

## 2.4. JSON

## 2.5. REST API

## 2.6. Google Services

### 2.6.1. Spreadsheets

### 2.6.2. Trends (Keywords)

---

# 3. Using **`dplyr`** for data manipulation

## 3.1.What's `dplyr`

The `dplyr` package is one of the most powerful and popular package in `R` for data manipulation.

Working with data:

- [x] Figure out what you want to do.
- [x] Describe those tasks in the form of a computer program.
- [x] Execute the program.

The `dplyr` package makes these steps fast and easy:

- [x] By constraining your options, it helps you think about your data manipulation challenges.
- [x] It provides simple `verbs`, functions that correspond to the most common data manipulation tasks, to help you translate your thoughts into code.
- [x] It uses efficient backends, so you spend less time waiting for the computer.

Before use you should install package:

In [11]:
#install.packages("dplyr")

Next step is loading package:

In [17]:
library(dplyr)

`dplyr` functions work with pipes and expect `tidy data`. In tidy data:

![](assets/images/03/dplyr1.png)

Alternative way is to load `tidyverse` package with other attached:

In [143]:
#install.packages("tidyverse")
library(tidyverse)
# to tidyverse attached packages
tidyverse_packages(include_self = TRUE)

 [1] "broom"         "cli"           "crayon"        "dbplyr"
 [5] "dplyr"         "dtplyr"        "forcats"       "googledrive"
 [9] "googlesheets4" "ggplot2"       "haven"         "hms"
[13] "httr"          "jsonlite"      "lubridate"     "magrittr"
[17] "modelr"        "pillar"        "purrr"         "readr"
[21] "readxl"        "reprex"        "rlang"         "rstudioapi"
[25] "rvest"         "stringr"       "tibble"        "tidyr"
[29] "xml2"          "tidyverse"

### 3.3. Exploring our data with dplyr `dplyr`

There are most popular functions in `dplyr` is listed in table.

|dplyr Function|Description	| Equivalent SQL|
|---|---|---|
|select()	|Selecting columns (variables)	|SELECT|
|filter()	|Filter (subset) rows.	|WHERE|
|group_by()|	Group the data	|GROUP BY|
|summarise()|	Summarise (or aggregate) data|	-|
|arrange()|	Sort the data	|ORDER BY
|join()|	Joining data frames (tables)|	JOIN|
|mutate()	|Creating New Variables|	COLUMN ALIAS|

Let's explore data with simple dataset `color_data`.

In [145]:
color_data <- data.frame(color = c("red", "green", "red", "green", "green"),
                          values = 1:5)
color_data

  color values
1 red   1
2 green 2
3 red   3
4 green 4
5 green 5

For the next sample we are going to use `gapminder` dataset. [Go to gapminder dataset description](00_Datasets.ipynb#gapminder)

The `gapminder` data frame include six variables:


|variable|meaning|
|---|---|
|country| - |	
|continent| - |		
|year| - |	
|lifeExp|	life expectancy at birth|
|pop	|total population|
|gdpPercap|	per-capita GDP|

`Per-capita GDP` (Gross domestic product) is given in units of international dollars, `a hypothetical unit of currency that has the same purchasing power parity that the U.S. dollar had in the United States at a given point in time` â€“ 2005, in this case.

The `gapminder` data frame is a special kind of data frame: a `tibble`.

In [138]:
class(gapminder)

[1] "tbl_df"     "tbl"        "data.frame"

In [137]:
library(gapminder) # load package and dataset

Let's preview it with functions `str()`, `glimpse()`, `head()`, `tail()`, `summary()`.

In [38]:
str(gapminder)

tibble[,6] [1,704 x 6] (S3: tbl_df/tbl/data.frame)
 $ country  : Factor w/ 142 levels "Afghanistan",..: 1 1 1 1 1 1 1 1 1 1 ...
 $ continent: Factor w/ 5 levels "Africa","Americas",..: 3 3 3 3 3 3 3 3 3 3 ...
 $ year     : int [1:1704] 1952 1957 1962 1967 1972 1977 1982 1987 1992 1997 ...
 $ lifeExp  : num [1:1704] 28.8 30.3 32 34 36.1 ...
 $ pop      : int [1:1704] 8425333 9240934 10267083 11537966 13079460 14880372 12881816 13867957 16317921 22227415 ...
 $ gdpPercap: num [1:1704] 779 821 853 836 740 ...

In [40]:
glimpse(gapminder)

Rows: 1,704
Columns: 6
$ country   <fct> "Afghanistan", "Afghanistan", "Afghanistan", "Afghanistan", ~
$ continent <fct> Asia, Asia, Asia, Asia, Asia, Asia, Asia, Asia, Asia, Asia, ~
$ year      <int> 1952, 1957, 1962, 1967, 1972, 1977, 1982, 1987, 1992, 1997, ~
$ lifeExp   <dbl> 28.801, 30.332, 31.997, 34.020, 36.088, 38.438, 39.854, 40.8~
$ pop       <int> 8425333, 9240934, 10267083, 11537966, 13079460, 14880372, 12~
$ gdpPercap <dbl> 779.4453, 820.8530, 853.1007, 836.1971, 739.9811, 786.1134, ~

In [44]:
head(gapminder) #shows first n-rows, 6 by default

  country     continent year lifeExp pop      gdpPercap
1 Afghanistan Asia      1952 28.801   8425333 779.4453
2 Afghanistan Asia      1957 30.332   9240934 820.8530
3 Afghanistan Asia      1962 31.997  10267083 853.1007
4 Afghanistan Asia      1967 34.020  11537966 836.1971
5 Afghanistan Asia      1972 36.088  13079460 739.9811
6 Afghanistan Asia      1977 38.438  14880372 786.1134

In [52]:
tail(gapminder) #shows last n-rows, 6 by default

  country  continent year lifeExp pop      gdpPercap
1 Zimbabwe Africa    1982 60.363   7636524 788.8550
2 Zimbabwe Africa    1987 62.351   9216418 706.1573
3 Zimbabwe Africa    1992 60.377  10704340 693.4208
4 Zimbabwe Africa    1997 46.809  11404948 792.4500
5 Zimbabwe Africa    2002 39.989  11926563 672.0386
6 Zimbabwe Africa    2007 43.487  12311143 469.7093

In [54]:
summary(gapminder)

        country        continent        year         lifeExp
 Afghanistan:  12   Africa  :624   Min.   :1952   Min.   :23.60
 Albania    :  12   Americas:300   1st Qu.:1966   1st Qu.:48.20
 Algeria    :  12   Asia    :396   Median :1980   Median :60.71
 Angola     :  12   Europe  :360   Mean   :1980   Mean   :59.47
 Argentina  :  12   Oceania : 24   3rd Qu.:1993   3rd Qu.:70.85
 Australia  :  12                  Max.   :2007   Max.   :82.60
 (Other)    :1632
      pop              gdpPercap
 Min.   :6.001e+04   Min.   :   241.2
 1st Qu.:2.794e+06   1st Qu.:  1202.1
 Median :7.024e+06   Median :  3531.8
 Mean   :2.960e+07   Mean   :  7215.3
 3rd Qu.:1.959e+07   3rd Qu.:  9325.5
 Max.   :1.319e+09   Max.   :113523.1

Let's get information about Canada in `gapminder` dataset:

In [135]:
# before this you can View(gapminder) in RStudio to find indexes
austria <- gapminder[73:84, ]
austria

   country continent year lifeExp pop     gdpPercap
1  Austria Europe    1952 66.800  6927772  6137.076
2  Austria Europe    1957 67.480  6965860  8842.598
3  Austria Europe    1962 69.540  7129864 10750.721
4  Austria Europe    1967 70.140  7376998 12834.602
5  Austria Europe    1972 70.630  7544201 16661.626
6  Austria Europe    1977 72.170  7568430 19749.422
7  Austria Europe    1982 73.180  7574613 21597.084
8  Austria Europe    1987 74.940  7578903 23687.826
9  Austria Europe    1992 76.040  7914969 27042.019
10 Austria Europe    1997 77.510  8069876 29095.921
11 Austria Europe    2002 78.980  8148312 32417.608
12 Austria Europe    2007 79.829  8199783 36126.493

Thats not a good idea for analyzing every country find row indexes.

#### 3.3.3.1. filter() function

`filter()` takes logical expressions and returns the rows for which all are TRUE.

In [64]:
# task: select rows with lifeExp less than 31
filter(gapminder, lifeExp < 31)

  country      continent year lifeExp pop     gdpPercap
1 Afghanistan  Asia      1952 28.801  8425333  779.4453
2 Afghanistan  Asia      1957 30.332  9240934  820.8530
3 Angola       Africa    1952 30.015  4232095 3520.6103
4 Gambia       Africa    1952 30.000   284320  485.2307
5 Rwanda       Africa    1992 23.599  7290203  737.0686
6 Sierra Leone Africa    1952 30.331  2143249  879.7877

In [67]:
# task: select canada only and year after 1980
filter(gapminder, country == "Austria", year > 1980)

  country continent year lifeExp pop      gdpPercap
1 Canada  Americas  1982 75.760  25201900 22898.79
2 Canada  Americas  1987 76.860  26549700 26626.52
3 Canada  Americas  1992 77.950  28523502 26342.88
4 Canada  Americas  1997 78.610  30305843 28954.93
5 Canada  Americas  2002 79.770  31902268 33328.97
6 Canada  Americas  2007 80.653  33390141 36319.24

In [74]:
# task: select canada only and year after 1980
filter(gapminder, country %in% c("Austria", "Belgium"))

   country continent year lifeExp pop      gdpPercap
1  Austria Europe    1952 66.800   6927772  6137.076
2  Austria Europe    1957 67.480   6965860  8842.598
3  Austria Europe    1962 69.540   7129864 10750.721
4  Austria Europe    1967 70.140   7376998 12834.602
5  Austria Europe    1972 70.630   7544201 16661.626
6  Austria Europe    1977 72.170   7568430 19749.422
7  Austria Europe    1982 73.180   7574613 21597.084
8  Austria Europe    1987 74.940   7578903 23687.826
9  Austria Europe    1992 76.040   7914969 27042.019
10 Austria Europe    1997 77.510   8069876 29095.921
11 Austria Europe    2002 78.980   8148312 32417.608
12 Austria Europe    2007 79.829   8199783 36126.493
13 Belgium Europe    1952 68.000   8730405  8343.105
14 Belgium Europe    1957 69.240   8989111  9714.961
15 Belgium Europe    1962 70.250   9218400 10991.207
16 Belgium Europe    1967 70.940   9556500 13149.041
17 Belgium Europe    1972 71.440   9709100 16672.144
18 Belgium Europe    1977 72.800   9821800 19117.974
19 Belgium Europe    1982 73.930   9856303 20979.846
20 Belgium Europe    1987 75.350   9870200 22525.563
21 Belgium Europe    1992 76.460  10045622 25575.571
22 Belgium Europe    1997 77.530  10199787 27561.197
23 Belgium Europe    2002 78.320  10311970 30485.884
24 Belgium Europe    2007 79.441  10392226 33692.605

Lets rewrite initial code:

In [77]:
austria <- filter(gapminder, country == "Austria")
austria

   country continent year lifeExp pop     gdpPercap
1  Austria Europe    1952 66.800  6927772  6137.076
2  Austria Europe    1957 67.480  6965860  8842.598
3  Austria Europe    1962 69.540  7129864 10750.721
4  Austria Europe    1967 70.140  7376998 12834.602
5  Austria Europe    1972 70.630  7544201 16661.626
6  Austria Europe    1977 72.170  7568430 19749.422
7  Austria Europe    1982 73.180  7574613 21597.084
8  Austria Europe    1987 74.940  7578903 23687.826
9  Austria Europe    1992 76.040  7914969 27042.019
10 Austria Europe    1997 77.510  8069876 29095.921
11 Austria Europe    2002 78.980  8148312 32417.608
12 Austria Europe    2007 79.829  8199783 36126.493

#### 3.3.2. Pipe (%>%) operator

`%>%` is `pipe` operator. The pipe operator takes the thing on the left-hand-side and pipes it into the function call on the right-hand-side â€“ literally, drops it in as the first argument.

`head()` function without pipe and top 4 items:

In [79]:
head(gapminder, n = 4)

  country     continent year lifeExp pop      gdpPercap
1 Afghanistan Asia      1952 28.801   8425333 779.4453
2 Afghanistan Asia      1957 30.332   9240934 820.8530
3 Afghanistan Asia      1962 31.997  10267083 853.1007
4 Afghanistan Asia      1967 34.020  11537966 836.1971

`head()` function with pipe and top 4 items:

In [81]:
gapminder %>% head(4)

  country     continent year lifeExp pop      gdpPercap
1 Afghanistan Asia      1952 28.801   8425333 779.4453
2 Afghanistan Asia      1957 30.332   9240934 820.8530
3 Afghanistan Asia      1962 31.997  10267083 853.1007
4 Afghanistan Asia      1967 34.020  11537966 836.1971

Output is the same. So, let's rewrire filtering for `Austria` with pipe:

In [84]:
austria <- gapminder %>% filter(country == "Austria")
austria

   country continent year lifeExp pop     gdpPercap
1  Austria Europe    1952 66.800  6927772  6137.076
2  Austria Europe    1957 67.480  6965860  8842.598
3  Austria Europe    1962 69.540  7129864 10750.721
4  Austria Europe    1967 70.140  7376998 12834.602
5  Austria Europe    1972 70.630  7544201 16661.626
6  Austria Europe    1977 72.170  7568430 19749.422
7  Austria Europe    1982 73.180  7574613 21597.084
8  Austria Europe    1987 74.940  7578903 23687.826
9  Austria Europe    1992 76.040  7914969 27042.019
10 Austria Europe    1997 77.510  8069876 29095.921
11 Austria Europe    2002 78.980  8148312 32417.608
12 Austria Europe    2007 79.829  8199783 36126.493

#### 3.3.4. `select` function

Use `select()` to subset the data on variables/columns by `names` or `index`. You also can define order of columns with `select()`.

In [89]:
select(gapminder, year, country, pop)

     year country     pop
1    1952 Afghanistan  8425333
2    1957 Afghanistan  9240934
3    1962 Afghanistan 10267083
4    1967 Afghanistan 11537966
5    1972 Afghanistan 13079460
6    1977 Afghanistan 14880372
7    1982 Afghanistan 12881816
8    1987 Afghanistan 13867957
9    1992 Afghanistan 16317921
10   1997 Afghanistan 22227415
11   2002 Afghanistan 25268405
12   2007 Afghanistan 31889923
13   1952 Albania      1282697
14   1957 Albania      1476505
15   1962 Albania      1728137
16   1967 Albania      1984060
17   1972 Albania      2263554
18   1977 Albania      2509048
19   1982 Albania      2780097
20   1987 Albania      3075321
21   1992 Albania      3326498
22   1997 Albania      3428038
23   2002 Albania      3508512
24   2007 Albania      3600523
25   1952 Algeria      9279525
26   1957 Algeria     10270856
27   1962 Algeria     11000948
28   1967 Algeria     12760499
29   1972 Algeria     14760787
30   1977 Algeria     17152804
...  ...  ...         ...
1675 1982 Yemen, Rep.  9657618
1676 1987 Yemen, Rep. 11219340
1677 1992 Yemen, Rep. 13367997
1678 1997 Yemen, Rep. 15826497
1679 2002 Yemen, Rep. 18701257
1680 2007 Yemen, Rep. 22211743
1681 1952 Zambia       2672000
1682 1957 Zambia       3016000
1683 1962 Zambia       3421000
1684 1967 Zambia       3900000
1685 1972 Zambia       4506497
1686 1977 Zambia       5216550
1687 1982 Zambia       6100407
1688 1987 Zambia       7272406
1689 1992 Zambia       8381163
1690 1997 Zambia       9417789
1691 2002 Zambia      10595811
1692 2007 Zambia      11746035
1693 1952 Zimbabwe     3080907
1694 1957 Zimbabwe     3646340
1695 1962 Zimbabwe     4277736
1696 1967 Zimbabwe     4995432
1697 1972 Zimbabwe     5861135
1698 1977 Zimbabwe     6642107
1699 1982 Zimbabwe     7636524
1700 1987 Zimbabwe     9216418
1701 1992 Zimbabwe    10704340
1702 1997 Zimbabwe    11404948
1703 2002 Zimbabwe    11926563
1704 2007 Zimbabwe    12311143

Lets combine few functions with `pipe` (`%>%`):

In [92]:
gapminder %>%
    select(year, country, pop, lifeExp) %>%
    head(4)

  year country     pop      lifeExp
1 1952 Afghanistan  8425333 28.801
2 1957 Afghanistan  9240934 30.332
3 1962 Afghanistan 10267083 31.997
4 1967 Afghanistan 11537966 34.020

Finally, lest extend our filtering:

In [95]:
austria <- gapminder %>% 
                filter(country == "Austria") %>%
                select(year, pop, lifeExp)
austria

   year pop     lifeExp
1  1952 6927772 66.800
2  1957 6965860 67.480
3  1962 7129864 69.540
4  1967 7376998 70.140
5  1972 7544201 70.630
6  1977 7568430 72.170
7  1982 7574613 73.180
8  1987 7578903 74.940
9  1992 7914969 76.040
10 1997 8069876 77.510
11 2002 8148312 78.980
12 2007 8199783 79.829

In [191]:
# compare dplyr syntax with base R call
gapminder[gapminder$country == "Austria", c("year", "pop", "lifeExp")]

   year pop     lifeExp
1  1952 6927772 66.800
2  1957 6965860 67.480
3  1962 7129864 69.540
4  1967 7376998 70.140
5  1972 7544201 70.630
6  1977 7568430 72.170
7  1982 7574613 73.180
8  1987 7578903 74.940
9  1992 7914969 76.040
10 1997 8069876 77.510
11 2002 8148312 78.980
12 2007 8199783 79.829

You can remove some columns using `minus`(operator):

In [193]:
austria <- gapminder %>% 
                filter(country == "Austria") %>%
                select(-continent, -gdpPercap) %>%
                head()
austria

  country year lifeExp pop
1 Austria 1952 66.80   6927772
2 Austria 1957 67.48   6965860
3 Austria 1962 69.54   7129864
4 Austria 1967 70.14   7376998
5 Austria 1972 70.63   7544201
6 Austria 1977 72.17   7568430

You can insert different conditions about columns you need to `select`.

In [194]:
gapminder %>%
    select(!where(is.numeric)) %>%
    head() # for short output

  country     continent
1 Afghanistan Asia
2 Afghanistan Asia
3 Afghanistan Asia
4 Afghanistan Asia
5 Afghanistan Asia
6 Afghanistan Asia

Let's output all unique pairs `continent -> country` with `distinct()` function:

In [196]:
gapminder %>%
    select(!where(is.numeric)) %>%
    distinct()

    country                  continent
1   Afghanistan              Asia
2   Albania                  Europe
3   Algeria                  Africa
4   Angola                   Africa
5   Argentina                Americas
6   Australia                Oceania
7   Austria                  Europe
8   Bahrain                  Asia
9   Bangladesh               Asia
10  Belgium                  Europe
11  Benin                    Africa
12  Bolivia                  Americas
13  Bosnia and Herzegovina   Europe
14  Botswana                 Africa
15  Brazil                   Americas
16  Bulgaria                 Europe
17  Burkina Faso             Africa
18  Burundi                  Africa
19  Cambodia                 Asia
20  Cameroon                 Africa
21  Canada                   Americas
22  Central African Republic Africa
23  Chad                     Africa
24  Chile                    Americas
25  China                    Asia
26  Colombia                 Americas
27  Comoros                  Africa
28  Congo, Dem. Rep.         Africa
29  Congo, Rep.              Africa
30  Costa Rica               Americas
... ...                      ...
113 Sierra Leone             Africa
114 Singapore                Asia
115 Slovak Republic          Europe
116 Slovenia                 Europe
117 Somalia                  Africa
118 South Africa             Africa
119 Spain                    Europe
120 Sri Lanka                Asia
121 Sudan                    Africa
122 Swaziland                Africa
123 Sweden                   Europe
124 Switzerland              Europe
125 Syria                    Asia
126 Taiwan                   Asia
127 Tanzania                 Africa
128 Thailand                 Asia
129 Togo                     Africa
130 Trinidad and Tobago      Americas
131 Tunisia                  Africa
132 Turkey                   Europe
133 Uganda                   Africa
134 United Kingdom           Europe
135 United States            Americas
136 Uruguay                  Americas
137 Venezuela                Americas
138 Vietnam                  Asia
139 West Bank and Gaza       Asia
140 Yemen, Rep.              Asia
141 Zambia                   Africa
142 Zimbabwe                 Africa

### 3.4. Selecting random $N$ rows

The `sample_n()` function selects random rows from a data frame

In [127]:
gapminder %>% sample_n(5)

  country            continent year lifeExp pop      gdpPercap
1 Libya              Africa    1962 47.808   1441863 6757.031
2 Botswana           Africa    1997 52.556   1536536 8647.142
3 Swaziland          Africa    1957 43.424    326741 1244.708
4 Dominican Republic Americas  1997 69.957   7992357 3614.101
5 Iraq               Asia      2002 57.046  24001816 4390.717

If you want make `pseudo-random generation` reprodusable use `set.seed()`. Seed is start point of random generation. Different seeds give different output.

In [128]:
set.seed(2021) # example, seed = 2021

The `sample_frac()` function selects random fraction rows from a data frame.
Let's select $1\%$ of data

In [151]:
set.seed(2021) # output not changing, uncomment it 
gapminder %>% sample_frac(0.01)

   country             continent year lifeExp pop      gdpPercap
1  Libya               Africa    1962 47.808   1441863  6757.0308
2  Botswana            Africa    1997 52.556   1536536  8647.1423
3  Swaziland           Africa    1957 43.424    326741  1244.7084
4  Dominican Republic  Americas  1997 69.957   7992357  3614.1013
5  Iraq                Asia      2002 57.046  24001816  4390.7173
6  Libya               Africa    1987 66.234   3799845 11770.5898
7  Montenegro          Europe    1967 67.178    501035  5907.8509
8  New Zealand         Oceania   1957 70.260   2229407 12247.3953
9  Bulgaria            Europe    2007 73.005   7322858 10680.7928
10 Malawi              Africa    1997 47.495  10419991   692.2758
11 Venezuela           Americas  1977 67.456  13503563 13143.9510
12 Guinea              Africa    1997 51.455   8048834   869.4498
13 Congo, Dem. Rep.    Africa    1952 39.143  14100005   780.5423
14 Eritrea             Africa    1962 40.158   1666618   380.9958
15 Bangladesh          Asia      1982 50.009  93074406   676.9819
16 Cote d'Ivoire       Africa    1952 40.477   2977019  1388.5947
17 Trinidad and Tobago Americas  2002 68.976   1101832 11460.6002

## Sorting with  **`arrange()`**

`arrange(.data, â€¦)` function order rows by values of a column or columns (low to high)You can use with `desc()` to order from high to low. 

For example, we need to select top 10 countries in 2002  by lifeExp variable.

In [180]:
data2002 <- gapminder %>% 
                filter(year == 2002) %>%
                top_n(10, lifeExp) # select top 10 by lifeExp value
data2002

   country          continent year lifeExp pop       gdpPercap
1  Australia        Oceania   2002 80.370   19546792 30687.75
2  Canada           Americas  2002 79.770   31902268 33328.97
3  Hong Kong, China Asia      2002 81.495    6762476 30209.02
4  Iceland          Europe    2002 80.500     288030 31163.20
5  Israel           Asia      2002 79.696    6029529 21905.60
6  Italy            Europe    2002 80.240   57926999 27968.10
7  Japan            Asia      2002 82.000  127065841 28604.59
8  Spain            Europe    2002 79.780   40152517 24835.47
9  Sweden           Europe    2002 80.040    8954175 29341.63
10 Switzerland      Europe    2002 80.620    7361757 34480.96

In [163]:
# sort by pop
data2002 %>% arrange(pop)

   country          continent year lifeExp pop       gdpPercap
1  Iceland          Europe    2002 80.500     288030 31163.20
2  Israel           Asia      2002 79.696    6029529 21905.60
3  Hong Kong, China Asia      2002 81.495    6762476 30209.02
4  Switzerland      Europe    2002 80.620    7361757 34480.96
5  Sweden           Europe    2002 80.040    8954175 29341.63
6  Australia        Oceania   2002 80.370   19546792 30687.75
7  Canada           Americas  2002 79.770   31902268 33328.97
8  Spain            Europe    2002 79.780   40152517 24835.47
9  Italy            Europe    2002 80.240   57926999 27968.10
10 Japan            Asia      2002 82.000  127065841 28604.59

In [164]:
# sort by pop from high to low
data2002 %>% arrange(desc(pop))

   country          continent year lifeExp pop       gdpPercap
1  Japan            Asia      2002 82.000  127065841 28604.59
2  Italy            Europe    2002 80.240   57926999 27968.10
3  Spain            Europe    2002 79.780   40152517 24835.47
4  Canada           Americas  2002 79.770   31902268 33328.97
5  Australia        Oceania   2002 80.370   19546792 30687.75
6  Sweden           Europe    2002 80.040    8954175 29341.63
7  Switzerland      Europe    2002 80.620    7361757 34480.96
8  Hong Kong, China Asia      2002 81.495    6762476 30209.02
9  Israel           Asia      2002 79.696    6029529 21905.60
10 Iceland          Europe    2002 80.500     288030 31163.20

## Make new variables with **`mutate()`**

`mutate(.data, â€¦)` compute new column(s). 
Lets compute new column for `data2002` $gdpTotal = gdpPercap * pop / 1000000$.

In [168]:
data2002 <- data2002 %>% mutate(gdpTotal = gdpPercap * pop)
data2002

   country          continent year lifeExp pop       gdpPercap gdpTotal
1  Australia        Oceania   2002 80.370   19546792 30687.75  5.998472e+11
2  Canada           Americas  2002 79.770   31902268 33328.97  1.063270e+12
3  Hong Kong, China Asia      2002 81.495    6762476 30209.02  2.042877e+11
4  Iceland          Europe    2002 80.500     288030 31163.20  8.975937e+09
5  Israel           Asia      2002 79.696    6029529 21905.60  1.320804e+11
6  Italy            Europe    2002 80.240   57926999 27968.10  1.620108e+12
7  Japan            Asia      2002 82.000  127065841 28604.59  3.634667e+12
8  Spain            Europe    2002 79.780   40152517 24835.47  9.972067e+11
9  Sweden           Europe    2002 80.040    8954175 29341.63  2.627301e+11
10 Switzerland      Europe    2002 80.620    7361757 34480.96  2.538404e+11

`transmute(.data, â€¦)` compute new column(s), drop others.

In [171]:
data2002 %>% transmute(gdpTotal = gdpPercap * pop)

   gdpTotal
1  5.998472e+11
2  1.063270e+12
3  2.042877e+11
4  8.975937e+09
5  1.320804e+11
6  1.620108e+12
7  3.634667e+12
8  9.972067e+11
9  2.627301e+11
10 2.538404e+11

You can `mutate` many columns at once:

In [198]:
data2002 <- data2002 %>% 
                mutate(gdpTotal = gdpPercap * pop,
                      countryUpper = toupper(country), # uppercase country
                      lifeExpRounded = round(lifeExp)) # rounded life expectation in 
data2002

   country          continent year lifeExp pop       gdpPercap gdpTotal
1  Australia        Oceania   2002 80.370   19546792 30687.75  5.998472e+11
2  Canada           Americas  2002 79.770   31902268 33328.97  1.063270e+12
3  Hong Kong, China Asia      2002 81.495    6762476 30209.02  2.042877e+11
4  Iceland          Europe    2002 80.500     288030 31163.20  8.975937e+09
5  Israel           Asia      2002 79.696    6029529 21905.60  1.320804e+11
6  Italy            Europe    2002 80.240   57926999 27968.10  1.620108e+12
7  Japan            Asia      2002 82.000  127065841 28604.59  3.634667e+12
8  Spain            Europe    2002 79.780   40152517 24835.47  9.972067e+11
9  Sweden           Europe    2002 80.040    8954175 29341.63  2.627301e+11
10 Switzerland      Europe    2002 80.620    7361757 34480.96  2.538404e+11
   countryUpper     lifeExpRounded
1  AUSTRALIA        80
2  CANADA           80
3  HONG KONG, CHINA 81
4  ICELAND          80
5  ISRAEL           80
6  ITALY            80
7  JAPAN            82
8  SPAIN            80
9  SWEDEN           80
10 SWITZERLAND      81

You also can edit existing column (let's change `continent Europe` to `EU` in dataframe):

In [202]:
data2002 %>%     
    mutate(
        continent = as.character(continent), # convert factor -> character 
        continent = ifelse(continent == "Europe", "EU", continent))

   country          continent year lifeExp pop       gdpPercap gdpTotal
1  Australia        Oceania   2002 80.370   19546792 30687.75  5.998472e+11
2  Canada           Americas  2002 79.770   31902268 33328.97  1.063270e+12
3  Hong Kong, China Asia      2002 81.495    6762476 30209.02  2.042877e+11
4  Iceland          EU        2002 80.500     288030 31163.20  8.975937e+09
5  Israel           Asia      2002 79.696    6029529 21905.60  1.320804e+11
6  Italy            EU        2002 80.240   57926999 27968.10  1.620108e+12
7  Japan            Asia      2002 82.000  127065841 28604.59  3.634667e+12
8  Spain            EU        2002 79.780   40152517 24835.47  9.972067e+11
9  Sweden           EU        2002 80.040    8954175 29341.63  2.627301e+11
10 Switzerland      EU        2002 80.620    7361757 34480.96  2.538404e+11
   countryUpper     lifeExpRounded
1  AUSTRALIA        80
2  CANADA           80
3  HONG KONG, CHINA 81
4  ICELAND          80
5  ISRAEL           80
6  ITALY            80
7  JAPAN            82
8  SPAIN            80
9  SWEDEN           80
10 SWITZERLAND      81

## Renaming columns with **`rename()`**

`rename(.data, â€¦)` rename columns.
Let's rename column `pop` to poulation:

In [181]:
data2002_renamed <- data2002 %>% 
                rename(population = pop) %>%
                select(1:5)
data2002_renamed

   country          continent year lifeExp population
1  Australia        Oceania   2002 80.370   19546792
2  Canada           Americas  2002 79.770   31902268
3  Hong Kong, China Asia      2002 81.495    6762476
4  Iceland          Europe    2002 80.500     288030
5  Israel           Asia      2002 79.696    6029529
6  Italy            Europe    2002 80.240   57926999
7  Japan            Asia      2002 82.000  127065841
8  Spain            Europe    2002 79.780   40152517
9  Sweden           Europe    2002 80.040    8954175
10 Switzerland      Europe    2002 80.620    7361757

## Calculations with **`group_by()`** + **`summarise()`**

`group_by(.data, ..., add = FALSE)` returns copy of table grouped by defined columns.

Let's find average by `lifeExp` for each `continent` in `2002` (ouput is `continent`, `lifeExpAvg2002`, `countriesCount`, `year = 2002`):

In [212]:
grouped_data2002 <- gapminder %>%
            filter(year == 2002) %>% # year
            group_by(continent) %>% # grouping condition
            summarise(
                lifeExpAvg2002 = mean(lifeExp),
                countriesCount = n() # n() count of rows in group                
            ) %>%
            mutate(year = 2002)
grouped_data2002

  continent lifeExpAvg2002 countriesCount year
1 Africa    53.32523       52             2002
2 Americas  72.42204       25             2002
3 Asia      69.23388       33             2002
4 Europe    76.70060       30             2002
5 Oceania   79.74000        2             2002

Let's find total `population` for each `continent` in `2002` (ouput is `continent`, `totalPop`, `year`):

In [211]:
grouped_data2002pop <- gapminder %>%
            filter(year == 2002) %>% # year
            group_by(continent) %>% # grouping condition
            summarise(
                totalPop = sum(pop)            
            ) %>%
            mutate(year = 2002)
grouped_data2002pop

  continent totalPop   year
1 Africa     833723916 2002
2 Americas   849772762 2002
3 Asia      3601802203 2002
4 Europe     578223869 2002
5 Oceania     23454829 2002

There are additional variations of `summarise()`:

- [x] `summarise_all()` - Apply funs to every column. 
- [x] `summarise_at()` - Apply funs to specific columns.  
- [x] `summarise_if()` - Apply funs to all cols of one type.

## Binding rows and columns

`bind_rows(.data, â€¦)` helps to unite two dataframes with the same columns order and names.

So, if we need add one data frame to an other vertically (bind rows) we shoul use `bind_rows`:

In [217]:
grouped_data2002 <- gapminder %>%
            filter(year == 2002) %>% # year
            group_by(continent) %>% # grouping condition
            summarise(
                lifeExpAvg = mean(lifeExp),
                countriesCount = n() # n() count of rows in group                
            ) %>%
            mutate(year = 2002)
grouped_data2002

  continent lifeExpAvg countriesCount year
1 Africa    53.32523   52             2002
2 Americas  72.42204   25             2002
3 Asia      69.23388   33             2002
4 Europe    76.70060   30             2002
5 Oceania   79.74000    2             2002

In [219]:
grouped_data2007 <- gapminder %>%
            filter(year == 2007) %>% # year
            group_by(continent) %>% # grouping condition
            summarise(
                lifeExpAvg = mean(lifeExp),
                countriesCount = n() # n() count of rows in group                
            ) %>%
            mutate(year = 2007)
grouped_data2007

  continent lifeExpAvg countriesCount year
1 Africa    54.80604   52             2007
2 Americas  73.60812   25             2007
3 Asia      70.72848   33             2007
4 Europe    77.64860   30             2007
5 Oceania   80.71950    2             2007

Unite them:

In [221]:
grouped_data <- grouped_data2002 %>%
                    bind_rows(grouped_data2007)
grouped_data

   continent lifeExpAvg countriesCount year
1  Africa    53.32523   52             2002
2  Americas  72.42204   25             2002
3  Asia      69.23388   33             2002
4  Europe    76.70060   30             2002
5  Oceania   79.74000    2             2002
6  Africa    54.80604   52             2007
7  Americas  73.60812   25             2007
8  Asia      70.72848   33             2007
9  Europe    77.64860   30             2007
10 Oceania   80.71950    2             2007

`bind_cols(.data, â€¦)` helps to unite two dataframes with the same rows count.

In [224]:
grouped_data2002pop <- gapminder %>%
            filter(year == 2002) %>% # year
            group_by(continent) %>% # grouping condition
            summarise(
                totalPop = sum(pop)            
            ) %>%
            mutate(year = 2002)
grouped_data2002pop

  continent totalPop   year
1 Africa     833723916 2002
2 Americas   849772762 2002
3 Asia      3601802203 2002
4 Europe     578223869 2002
5 Oceania     23454829 2002

Let's combine `grouped_data2002` and `popgrouped_data2002pop`:

In [228]:
grouped_data <- grouped_data2002 %>% 
                    bind_cols(grouped_data2002pop)
grouped_data

# columns with the same name were renamed!

New names:
* continent -> continent...1
* year -> year...4
* continent -> continent...5
* year -> year...7

  continent...1 lifeExpAvg countriesCount year...4 continent...5 totalPop
1 Africa        53.32523   52             2002     Africa         833723916
2 Americas      72.42204   25             2002     Americas       849772762
3 Asia          69.23388   33             2002     Asia          3601802203
4 Europe        76.70060   30             2002     Europe         578223869
5 Oceania       79.74000    2             2002     Oceania         23454829
  year...7
1 2002
2 2002
3 2002
4 2002
5 2002

You can remove same named variables before binding:

In [231]:
grouped_data <- grouped_data2002 %>% 
                    bind_cols(grouped_data2002pop %>%
                                select(-continent, -year))
grouped_data

# better, but continents order is not the same in both frames 
# your data is going to be damaged

  continent lifeExpAvg countriesCount year totalPop
1 Africa    53.32523   52             2002  833723916
2 Americas  72.42204   25             2002  849772762
3 Asia      69.23388   33             2002 3601802203
4 Europe    76.70060   30             2002  578223869
5 Oceania   79.74000    2             2002   23454829

In [234]:
grouped_data2002pop <- grouped_data2002pop %>% arrange(totalPop)

grouped_data <- grouped_data2002 %>% 
                    bind_cols(grouped_data2002pop)
grouped_data

# you can see that continent fields different in the same row

New names:
* continent -> continent...1
* year -> year...4
* continent -> continent...5
* year -> year...7

  continent...1 lifeExpAvg countriesCount year...4 continent...5 totalPop
1 Africa        53.32523   52             2002     Oceania         23454829
2 Americas      72.42204   25             2002     Europe         578223869
3 Asia          69.23388   33             2002     Africa         833723916
4 Europe        76.70060   30             2002     Americas       849772762
5 Oceania       79.74000    2             2002     Asia          3601802203
  year...7
1 2002
2 2002
3 2002
4 2002
5 2002

## `Join()`ing data

To solve previous problem you can use set of `join()`-functions. `left_join()` can solve our previous example:

In [236]:
grouped_data2002pop <- grouped_data2002pop %>% arrange(totalPop)

grouped_data <- grouped_data2002 %>% 
                    left_join(grouped_data2002pop, by = "continent")
grouped_data

# but we have duplicated year

  continent lifeExpAvg countriesCount year.x totalPop   year.y
1 Africa    53.32523   52             2002    833723916 2002
2 Americas  72.42204   25             2002    849772762 2002
3 Asia      69.23388   33             2002   3601802203 2002
4 Europe    76.70060   30             2002    578223869 2002
5 Oceania   79.74000    2             2002     23454829 2002

In [239]:
grouped_data2002pop <- grouped_data2002pop %>% arrange(totalPop)

grouped_data <- grouped_data2002 %>% 
                    left_join(grouped_data2002pop, by = c("continent", "year"))
grouped_data

#ok

  continent lifeExpAvg countriesCount year totalPop
1 Africa    53.32523   52             2002  833723916
2 Americas  72.42204   25             2002  849772762
3 Asia      69.23388   33             2002 3601802203
4 Europe    76.70060   30             2002  578223869
5 Oceania   79.74000    2             2002   23454829

Let's make a different data sets for testing `join()` fucntions:

In [241]:
first_df <- data.frame(Letter = c("A", "B", "C", "D", "E"),
                      Value = c(1:5))

second_df <- data.frame(Letter = c("A", "B", "C", "D", "F"),
                      Value = c(12, 7, 4, 1, 5))
first_df
second_df

  Letter Value
1 A      1
2 B      2
3 C      3
4 D      4
5 E      5

  Letter Value
1 A      12
2 B       7
3 C       4
4 D       1
5 F       5

You can see that the last row `Letter` is different in dataframes. `left_join()` test is next.

In [246]:
first_df %>% left_join(second_df, by = "Letter")

# there is no F letter, becouse first_db joined only known first_df Letters.

  Letter Value.x Value.y
1 A      1       12
2 B      2        7
3 C      3        4
4 D      4        1
5 E      5       NA

In [248]:
first_df %>% right_join(second_df, by = "Letter")

# right_join! there is no E letter, becouse first_db joined only known second_df Letters.

  Letter Value.x Value.y
1 A       1      12
2 B       2       7
3 C       3       4
4 D       4       1
5 F      NA       5

In [251]:
first_df %>% inner_join(second_df, by = "Letter")

# inner_join! there is no E and F Letters, 
# only known both first_df and second_df are left here.

  Letter Value.x Value.y
1 A      1       12
2 B      2        7
3 C      3        4
4 D      4        1

In [254]:
first_df %>% full_join(second_df, by = "Letter")

# all are here, but unknown values replaced by NA, it's ok.

  Letter Value.x Value.y
1 A       1      12
2 B       2       7
3 C       3       4
4 D       4       1
5 E       5      NA
6 F      NA       5

## Data cleaning with `gather()`

Some times your data is not in tidy format. Peole can collect data year by year in each column. It's problem to use such data for feature engeniering and building prediction models. Let's generate such data sample (quaterly salary of some people).

In [257]:
not_good_data <- data.frame(Name = c("Nick", "Jake", "Anna", "Jane", "Dina"),
                           q1_2021 = c(12442, 22131, 21343, 22111, 14123),
                           q2_2021 = c(13442, 22871, 20343, 22222, 14456),
                           q3_2021 = c(15482, 22031, 22456, 22444, 14533),
                           q4_2021 = c(14511, 20031, 21741, 22333, 14511))
not_good_data

  Name q1_2021 q2_2021 q3_2021 q4_2021
1 Nick 12442   13442   15482   14511
2 Jake 22131   22871   22031   20031
3 Anna 21343   20343   22456   21741
4 Jane 22111   22222   22444   22333
5 Dina 14123   14456   14533   14511

In [269]:
better_data <- not_good_data %>%
                gather(quater, salary, 2:5)
                # gather(quater, salary, q1_2021:q4_2021) possible code too
better_data

   Name quater  salary
1  Nick q1_2021 12442
2  Jake q1_2021 22131
3  Anna q1_2021 21343
4  Jane q1_2021 22111
5  Dina q1_2021 14123
6  Nick q2_2021 13442
7  Jake q2_2021 22871
8  Anna q2_2021 20343
9  Jane q2_2021 22222
10 Dina q2_2021 14456
11 Nick q3_2021 15482
12 Jake q3_2021 22031
13 Anna q3_2021 22456
14 Jane q3_2021 22444
15 Dina q3_2021 14533
16 Nick q4_2021 14511
17 Jake q4_2021 20031
18 Anna q4_2021 21741
19 Jane q4_2021 22333
20 Dina q4_2021 14511

To make our data tidier `separate()` can split quater column into 2 (`quater` and `year`):

In [292]:
better_data %>%
    separate(quater, c("quater", "year"), sep = "_") %>% # separate
    mutate(year = as.integer(year), # convert year to integer
           quater = substr(better_data$quater, 2,2), # trim `q` from start
           quater = as.integer(quater), # convert quater to integer
          ) %>%
    head(10)

   Name quater year salary
1  Nick 1      2021 12442
2  Jake 1      2021 22131
3  Anna 1      2021 21343
4  Jane 1      2021 22111
5  Dina 1      2021 14123
6  Nick 2      2021 13442
7  Jake 2      2021 22871
8  Anna 2      2021 20343
9  Jane 2      2021 22222
10 Dina 2      2021 14456

If you need to make table like initial use `spread()` function:

In [262]:
not_good_data2 <- better_data %>%
                    spread(quater, salary)
not_good_data2

  Name q1_2021 q2_2021 q3_2021 q4_2021
1 Anna 21343   20343   22456   21741
2 Dina 14123   14456   14533   14511
3 Jake 22131   22871   22031   20031
4 Jane 22111   22222   22444   22333
5 Nick 12442   13442   15482   14511

Let's try to `spread()` feild `pop` of `gapminder` by year:

In [268]:
gapminder %>% select(country, pop, year) %>%
                spread(year, pop)

# now you can easyly send data to your director in excel :)

    country                  1952      1957      1962      1967      1972
1   Afghanistan                8425333   9240934  10267083  11537966  13079460
2   Albania                    1282697   1476505   1728137   1984060   2263554
3   Algeria                    9279525  10270856  11000948  12760499  14760787
4   Angola                     4232095   4561361   4826015   5247469   5894858
5   Argentina                 17876956  19610538  21283783  22934225  24779799
6   Australia                  8691212   9712569  10794968  11872264  13177000
7   Austria                    6927772   6965860   7129864   7376998   7544201
8   Bahrain                     120447    138655    171863    202182    230800
9   Bangladesh                46886859  51365468  56839289  62821884  70759295
10  Belgium                    8730405   8989111   9218400   9556500   9709100
11  Benin                      1738315   1925173   2151895   2427334   2761407
12  Bolivia                    2883315   3211738   3593918   4040665   4565872
13  Bosnia and Herzegovina     2791000   3076000   3349000   3585000   3819000
14  Botswana                    442308    474639    512764    553541    619351
15  Brazil                    56602560  65551171  76039390  88049823 100840058
16  Bulgaria                   7274900   7651254   8012946   8310226   8576200
17  Burkina Faso               4469979   4713416   4919632   5127935   5433886
18  Burundi                    2445618   2667518   2961915   3330989   3529983
19  Cambodia                   4693836   5322536   6083619   6960067   7450606
20  Cameroon                   5009067   5359923   5793633   6335506   7021028
21  Canada                    14785584  17010154  18985849  20819767  22284500
22  Central African Republic   1291695   1392284   1523478   1733638   1927260
23  Chad                       2682462   2894855   3150417   3495967   3899068
24  Chile                      6377619   7048426   7961258   8858908   9717524
25  China                    556263527 637408000 665770000 754550000 862030000
26  Colombia                  12350771  14485993  17009885  19764027  22542890
27  Comoros                     153936    170928    191689    217378    250027
28  Congo, Dem. Rep.          14100005  15577932  17486434  19941073  23007669
29  Congo, Rep.                 854885    940458   1047924   1179760   1340458
30  Costa Rica                  926317   1112300   1345187   1588717   1834796
... ...                      ...       ...       ...       ...       ...
113 Sierra Leone               2143249   2295678   2467895   2662190   2879013
114 Singapore                  1127000   1445929   1750200   1977600   2152400
115 Slovak Republic            3558137   3844277   4237384   4442238   4593433
116 Slovenia                   1489518   1533070   1582962   1646912   1694510
117 Somalia                    2526994   2780415   3080153   3428839   3840161
118 South Africa              14264935  16151549  18356657  20997321  23935810
119 Spain                     28549870  29841614  31158061  32850275  34513161
120 Sri Lanka                  7982342   9128546  10421936  11737396  13016733
121 Sudan                      8504667   9753392  11183227  12716129  14597019
122 Swaziland                   290243    326741    370006    420690    480105
123 Sweden                     7124673   7363802   7561588   7867931   8122293
124 Switzerland                4815000   5126000   5666000   6063000   6401400
125 Syria                      3661549   4149908   4834621   5680812   6701172
126 Taiwan                     8550362  10164215  11918938  13648692  15226039
127 Tanzania                   8322925   9452826  10863958  12607312  14706593
128 Thailand                  21289402  25041917  29263397  34024249  39276153
129 Togo                       1219113   1357445   1528098   1735550   2056351
130 Trinidad and Tobago         662850    764900    887498    960155    975199
131 Tunisia                    3647735   3950849   4286552   4786986   5303507
132 Turkey                    22235677  25670939  29788695  33411317  37492953
133 Uganda                     5824797   6675501   7688797   8900294  10190285
134 United Kingdom            50430000  51430000  53292000  54959000  56079000
135 United States            157553000 171984000 186538000 198712000 209896000
136 Uruguay                    2252965   2424959   2598466   2748579   2829526
137 Venezuela                  5439568   6702668   8143375   9709552  11515649
138 Vietnam                   26246839  28998543  33796140  39463910  44655014
139 West Bank and Gaza         1030585   1070439   1133134   1142636   1089572
140 Yemen, Rep.                4963829   5498090   6120081   6740785   7407075
141 Zambia                     2672000   3016000   3421000   3900000   4506497
142 Zimbabwe                   3080907   3646340   4277736   4995432   5861135
    1977      1982       1987       1992       1997       2002       2007
1    14880372   12881816   13867957   16317921   22227415   25268405   31889923
2     2509048    2780097    3075321    3326498    3428038    3508512    3600523
3    17152804   20033753   23254956   26298373   29072015   31287142   33333216
4     6162675    7016384    7874230    8735988    9875024   10866106   12420476
5    26983828   29341374   31620918   33958947   36203463   38331121   40301927
6    14074100   15184200   16257249   17481977   18565243   19546792   20434176
7     7568430    7574613    7578903    7914969    8069876    8148312    8199783
8      297410     377967     454612     529491     598561     656397     708573
9    80428306   93074406  103764241  113704579  123315288  135656790  150448339
10    9821800    9856303    9870200   10045622   10199787   10311970   10392226
11    3168267    3641603    4243788    4981671    6066080    7026113    8078314
12    5079716    5642224    6156369    6893451    7693188    8445134    9119152
13    4086000    4172693    4338977    4256013    3607000    4165416    4552198
14     781472     970347    1151184    1342614    1536536    1630347    1639131
15  114313951  128962939  142938076  155975974  168546719  179914212  190010647
16    8797022    8892098    8971958    8658506    8066057    7661799    7322858
17    5889574    6634596    7586551    8878303   10352843   12251209   14326203
18    3834415    4580410    5126023    5809236    6121610    7021078    8390505
19    6978607    7272485    8371791   10150094   11782962   12926707   14131858
20    7959865    9250831   10780667   12467171   14195809   15929988   17696293
21   23796400   25201900   26549700   28523502   30305843   31902268   33390141
22    2167533    2476971    2840009    3265124    3696513    4048013    4369038
23    4388260    4875118    5498955    6429417    7562011    8835739   10238807
24   10599793   11487112   12463354   13572994   14599929   15497046   16284741
25  943455000 1000281000 1084035000 1164970000 1230075000 1280400000 1318683096
26   25094412   27764644   30964245   34202721   37657830   41008227   44227550
27     304739     348643     395114     454429     527982     614382     710960
28   26480870   30646495   35481645   41672143   47798986   55379852   64606759
29    1536769    1774735    2064095    2409073    2800947    3328795    3800610
30    2108457    2424367    2799811    3173216    3518107    3834934    4133884
... ...       ...        ...        ...        ...        ...        ...
113   3140897   3464522    3868905    4260884    4578212    5359092    6144562
114   2325300   2651869    2794552    3235865    3802309    4197776    4553009
115   4827803   5048043    5199318    5302888    5383010    5410052    5447502
116   1746919   1861252    1945870    1999210    2011612    2011497    2009245
117   4353666   5828892    6921858    6099799    6633514    7753310    9118773
118  27129932  31140029   35933379   39964159   42835005   44433622   43997828
119  36439000  37983310   38880702   39549438   39855442   40152517   40448191
120  14116836  15410151   16495304   17587060   18698655   19576783   20378239
121  17104986  20367053   24725960   28227588   32160729   37090298   42292929
122    551425    649901     779348     962344    1054486    1130269    1133066
123   8251648   8325260    8421403    8718867    8897619    8954175    9031088
124   6316424   6468126    6649942    6995447    7193761    7361757    7554661
125   7932503   9410494   11242847   13219062   15081016   17155814   19314747
126  16785196  18501390   19757799   20686918   21628605   22454239   23174294
127  17129565  19844382   23040630   26605473   30686889   34593779   38139640
128  44148285  48827160   52910342   56667095   60216677   62806748   65068149
129   2308582   2644765    3154264    3747553    4320890    4977378    5701579
130   1039009   1116479    1191336    1183669    1138101    1101832    1056608
131   6005061   6734098    7724976    8523077    9231669    9770575   10276158
132  42404033  47328791   52881328   58179144   63047647   67308928   71158647
133  11457758  12939400   15283050   18252190   21210254   24739869   29170398
134  56179000  56339704   56981620   57866349   58808266   59912431   60776238
135 220239000 232187835  242803533  256894189  272911760  287675526  301139947
136   2873520   2953997    3045153    3149262    3262838    3363085    3447496
137  13503563  15620766   17910182   20265563   22374398   24287670   26084662
138  50533506  56142181   62826491   69940728   76048996   80908147   85262356
139   1261091   1425876    1691210    2104779    2826046    3389578    4018332
140   8403990   9657618   11219340   13367997   15826497   18701257   22211743
141   5216550   6100407    7272406    8381163    9417789   10595811   11746035
142   6642107   7636524    9216418   10704340   11404948   11926563   12311143

---

## Refences

1. [dplyr: A Grammar of Data Manipulation](https://cran.r-project.org/web/packages/dplyr/index.html) on https://cran.r-project.org/.
2. [Data Transformation with splyr::cheat sheet](https://github.com/rstudio/cheatsheets/blob/master/data-transformation.pdf).
3. [DPLYR TUTORIAL : DATA MANIPULATION (50 EXAMPLES)](https://www.listendata.com/2016/08/dplyr-tutorial.html) by Deepanshu Bhalla.

5. [Dplyr Intro](https://stat545.com/dplyr-intro.html) by Stat 545.